DiplomD/src/Reports/ОтчетОПроведенииСессии/ОтчетОПроведенииСессии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетОПроведенииСессии</name>
  <attributes>
    <name>ПериодСессии</name>
    <type>
      <types>CatalogRef.ПланСдачиСессии</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСессии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСессии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.Группы</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВыставленныхОценок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПроведенныхПереаттестаций</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоАкадемическихЗадолженностей</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Report>

DiplomD/src/AccumulationRegisters/Сессия/Сессия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Сессия</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КолчиествоВыставленныхОценок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоАкадемическихЗадолженностей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПроведенныхПереаттестаций</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

DiplomD/src/Catalogs/ПланСдачиСессии/ПланСдачиСессии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПланСдачиСессии</name>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодНачалаСессии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОкончанияСессии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоСеметраДляТестов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецСеместраДляТестов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

DiplomD/src/Reports/ОтчетОПроведенииСессии/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ПериодСессииПриИзмененииНаСервере()
	Спр = Справочники.ПланСдачиСессии.НайтиПоНаименованию(Отчет.ПериодСессии); 
	Отчет.ДатаНачалаСессии = Спр.ПериодНачалаСессии; 
	Отчет.ДатаОкончанияСессии = Спр.периодОкончанияСессии; 
	Отчет.Семестр = Спр.Семестр; 
	Отчет.ФормаОбучения = Спр.ФормаОбучения; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСессииПриИзменении(Элемент)
	ПериодСессииПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	Отчет.ТЧ.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СессияОбороты.Группа КАК Группа,
	               |	СессияОбороты.КолчиествоВыставленныхОценокОборот КАК КолчиествоВыставленныхОценокОборот,
	               |	СессияОбороты.КоличествоАкадемическихЗадолженностейОборот КАК КоличествоАкадемическихЗадолженностейОборот,
	               |	СессияОбороты.КоличествоПроведенныхПереаттестацийОборот КАК КоличествоПроведенныхПереаттестацийОборот
	               |ИЗ
	               |	РегистрНакопления.Сессия.Обороты КАК СессияОбороты
	               |ГДЕ
	               |	СессияОбороты.Семестр = &Семестр"; 
	Запрос.УстановитьПараметр("Семестр",отчет.Семестр); 
	рез = Запрос.Выполнить().Выгрузить(); 
	
	Для каждого стр из рез Цикл 
		Спр = Справочники.Группы.НайтиПоНаименованию(Стр.Группа); 
		Если Спр.ФормаОбучения = отчет.ФормаОбучения Тогда 
		О= Отчет.ТЧ.Добавить(); 
		О.Группа = Стр.Группа; 
		О.КоличествоВыставленныхОценок = Стр.КолчиествоВыставленныхОценокОборот;
		О.КоличествоАкадемическихЗадолженностей = Стр.КоличествоАкадемическихЗадолженностейОборот;
		О.КоличествоПроведенныхПереаттестаций = Стр.КоличествоПроведенныхПереаттестацийОборот;  
		Конецесли; 	
		КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Функция ПЕЧАТЬНаСервере()
	ТабДок = новый ТабличныйДокумент; 
	
	Макет = отчеты.ОтчетОПроведенииСессии.ПолучитьМакет("Макет"); 
	
	Шапка = Макет.ПолучитьОбласть("Шапка"); 
	Шапка.Параметры.Дат1 = Отчет.ДатаНачалаСессии; 
	Шапка.Параметры.Дат2 = Отчет.ДатаОкончанияСессии; 
	Шапка.Параметры.Сем = Отчет.Семестр; 
	Шапка.Параметры.ФормО = Отчет.ФормаОбучения; 
	
	ТабДок.Вывести(Шапка); 
	
	шапкаТабл = Макет.ПолучитьОбласть("ШапкаТабл"); 
	Табдок.Вывести(ШапкаТабл); 
	
	Табл = Макет.ПолучитьОбласть("Табл"); 
	
	Для каждого стр из Отчет.ТЧ Цикл 
		Табл.Параметры.Груп = Стр.Группа; 
		Табл.Параметры.КолВыст = Стр.КоличествоВыставленныхОценок; 
		Табл.Параметры.КолПереат = Стр.КоличествоПроведенныхПереаттестаций; 
		Табл.Параметры.КолЗадол = Стр.КоличествоАкадемическихЗадолженностей; 
		ТабДок.Вывести(Табл); 
		
	КонецЦикла; 
	
	Возврат ТабДок; 
	
КонецФункции

&НаКлиенте
Процедура ПЕЧАТЬ(Команда)
	ТабДок = Новый ТабличныйДокумент; 
	ТабДок = ПЕЧАТЬНаСервере(); 
	ТабДок.Показать();
КонецПроцедуры
